app/controllers/v1/menus_controller.rb

SELECT "menus".* FROM "menus"
---
    def index
        menus = Menu.all

INSERT INTO "menus" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "es teh"], ["price", "50000"], ["created_at", "2018-09-21 15:13:32.204327"], ["updated_at", "2018-09-21 15:13:32.204327"]]
---
    def create
        menu = Menu.create(menu_params)

UPDATE "menus" SET "name" = $1, "price" = $2, "updated_at" = $3 WHERE "menus"."id" = $4  [["name", "es cincau"], ["price", "40000"], ["updated_at", "2018-09-21 15:21:59.371901"], ["id", 1]]
---
    def update
        if @menu.update(menu_params)

DELETE FROM "menus" WHERE "menus"."id" = $1  [["id", 2]]
---
    def delete
        if @menu.destroy

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_menu
        @menu = Menu.find(params[:id])