app/controllers/v1/orders_controller.rb

INSERT INTO "orders" ("address", "menu_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "jalan demangan1"], ["menu_id", 1], ["user_id", 1], ["created_at", "2018-09-21 15:40:40.305836"], ["updated_at", "2018-09-21 15:40:40.305836"]]
---
    def create
        order = current_user.orders.create(order_params)