app/controllers/v1/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        user = User.create(user_params)

UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "gabriel123"], ["password_digest", "$2a$10$L7K3b2OD5e2QQdE2Quk5eug5lIrO/U5G9I02YcGokbI5rAujnZFA2"], ["updated_at", "2018-09-21 15:03:27.672557"], ["id", 1]]
---
    def update
        if @user.update(user_params)